OF_files/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

libs (
      "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
     );



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

// startFrom       startTime;
startFrom       latestTime
// startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  probes
	{
	type				probes;
	functionObjectLibs ("libsampling.so");
	enabled				false;			// switch: true or false
	outputControl		timeStep;
	outputInterval		10;		// interval to output
	
	fields				// variables to output
	(
		U
		k
		epsilon
	);
	probeLocations			// location(s) to probe in (x y z)
	(
	  		(  0.6  0 0.18 )
			(  0.6  0.405 0.045 )
	 		(  0.6  0.9 0.045 )
	);
	}

}
// ************************************************************************* //
