OF_files/constant/sourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
TSource
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (571.5 646.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            T   1.0;
        }
    }
}
Tr01Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (502.5 760.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr01   1.0;
        }
    }
}
Tr02Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (487.5 893.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr02   1.0;
        }
    }
}
Tr03Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (580.5 892.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr03   1.0;
        }
    }
}
Tr04Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (507.5 993.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr04   1.0;
        }
    }
}
Tr05Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (508.5 1105.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr05   1.0;
        }
    }
}
Tr06Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (666.5 1100.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr06   1.0;
        }
    }
}
Tr07Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (488.5 1242.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr07   1.0;
        }
    }
}
Tr08Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (536.5 1522.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr08   1.0;
        }
    }
}
Tr09Source
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0;
    duration        1000000;
    selectionMode   points;
    points
    (
        (670.5 1515.2 0.2)
    );

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            Tr09   1.0;
        }
    }
}
// ************************************************************************* //
