OF_files/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-05;

Pr              Pr [0 0 0 0 0 0 0] 1.00;

Prt           	Prt [0 0 0 0 0 0 0] 0.70;

nutLower		nutLower [ 0 2 -1 0 0 0 0 ] 0.0;

nutUpper		nutUpper [ 0 2 -1 0 0 0 0 ] 1.0e+10;

// ************************************************************************* //
