OF_files/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    Inlet
    {
      //type            fixedValue;
      //value           uniform (10 0 0);
      type	groovyBC;
      value	$internalField;
      //valueExpression is written as __ ? __(true) : __(false)
      //valueExpression   "(pos().z<=0.6) ? vector(-7.5335*pow(pos().z,2.0)+10.962*pos().z+2.9155,0,0) : vector(6.751,0,0)"; 
	  valueExpression   "vector(0,7.41*pow(pos().z/45,0.35),0)";
    }
	Outlet
    {
        type            zeroGradient;
    }
		
	"(Ground|Building)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

	"(Paral|Roof)"
    {
        type            symmetryPlane;
    }

}

// ************************************************************************* //
