OF_files/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.4372;

boundaryField
{
 Inlet
    {
      //type            fixedValue;
      //value           uniform 0.4372;
      type	groovyBC;
      value	$internalField;
      //valueExpression is written as __ ? __(true) : __(false)
      //valueExpression   "(pos().z<=0.6) ? (-0.632*log(pos().z)+0.1144) : 0.4372"; 
	  valueExpression   "pow(0.48,3)/0.4/pos().z*(1-pos().z/200)";
    }
	Outlet
    {
        type            zeroGradient;
    }
		
	"(Ground|Building)"
    {
        type            epsilonWallFunction;
		value			$internalField;
    }

	"(Paral|Roof)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
