OF_files/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.106;

boundaryField
{

    Inlet
    {
      type	groovyBC;
      value	$internalField;
      //valueExpression   "(pos().z<=0.6) ? (8.1573*pow(pos().z,3.0)-11.234*pow(pos().z,2.0)+3.3643*pos().z+0.3671) : 0.106"; 
	  valueExpression   "pow(0.48,2)/0.3*(1-pos().z/200)";
    }
	Outlet
    {
        type            zeroGradient;
    }
		
	"(Ground|Building)"
    {
        type            kqRWallFunction;
		value			$internalField;
    }
	"(Paral|Roof)"
    {
		type            symmetryPlane;
    }
}


// ************************************************************************* //
