OF_files/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
	Outlet
    {
        type            zeroGradient;
    }
		
	"(Ground|Building)"
    {
        //type            nutkRoughWallFunction;
        //Ks				uniform 0.01;
		//Cs				uniform 0.5;
		type            nutkWallFunction;
		value			$internalField;
	}

	"(Paral|Roof)"
    {
        type            symmetryPlane;
    }	
	
	
	
	
	
}


// ************************************************************************* //
