OF_files/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format.
setFormat jplot;

// optionally define extra controls for the output formats
formatOptions
{
    ensight
    {
        format  ascii;
    }
}

// interpolationScheme.
interpolationScheme cell;

// Fields to sample.
fields
(
    T
    Tr1
    Tr2
    Tr3
    Tr4
    Tr5
    Tr6
    Tr7
    Tr8
    Tr9
);

// Set sampling definition.
sets
(
    samplePoints
    {
        type    cloud;
        axis    xyz;
        points  (
                (201 1 1)
                (203 1 1)
                (205 1 1)
                (207 1 1)
                (209 1 1)
                (211 1 1)
                (213 1 1)
                (215 1 1)
                (217 1 1)
                (219 1 1)
                (221 1 1)
                (223 1 1)
                (225 1 1)
                (227 1 1)
                (229 1 1)
                (231 1 1)
                (233 1 1)
                (235 1 1)
                (237 1 1)
                (239 1 1)
                (241 1 1)
                (243 1 1)
                (245 1 1)
                (247 1 1)
                (249 1 1)
                (251 1 1)
                (253 1 1)
                (255 1 1)
                (257 1 1)
                (259 1 1)
                (261 1 1)
                (263 1 1)
                (265 1 1)
                (267 1 1)
                (269 1 1)
                (271 1 1)
                (273 1 1)
                (275 1 1)
                (277 1 1)
                (279 1 1)
                (281 1 1)
                (283 1 1)
                (285 1 1)
                (287 1 1)
                (289 1 1)
                (291 1 1)
                (293 1 1)
                (295 1 1)
                (297 1 1)
                (299 1 1)
                (301 1 1)
                (303 1 1)
                (305 1 1)
                (307 1 1)
                (309 1 1)
                (311 1 1)
                (313 1 1)
                (315 1 1)
                (317 1 1)
                (319 1 1)
                (321 1 1)
                (323 1 1)
                (325 1 1)
                (327 1 1)
                (329 1 1)
                (331 1 1)
                (333 1 1)
                (335 1 1)
                (337 1 1)
                (339 1 1)
                (341 1 1)
                (343 1 1)
                (345 1 1)
                (347 1 1)
                (349 1 1)
                (351 1 1)
                (353 1 1)
                (355 1 1)
                (357 1 1)
                (359 1 1)
                (361 1 1)
                (363 1 1)
                (365 1 1)
                (367 1 1)
                (369 1 1)
                (371 1 1)
                (373 1 1)
                (375 1 1)
                (377 1 1)
                (379 1 1)
                (381 1 1)
                (383 1 1)
                (385 1 1)
                (387 1 1)
                (389 1 1)
                (391 1 1)
                (393 1 1)
                (395 1 1)
                (397 1 1)
                (399 1 1)
...
                );
    }
);

// *********************************************************************** //
